{"title":"CSS Fundamentals","subtitle":"In this Section, we are exploring all the basics of CSS.","tips":[{"title":"Get\n                Started with HTML","description":"Explore our beginner-friendly docs for HTML to get yourself started with Web Development","url":"html-fundamentals.html","type":"documents"},{"title":"Get Started with\n                CSS","description":"Already Know HTML! Checkout our most comprehensive and detailed guide for CSS","url":"","type":"documents"}],"main":{"title":"Get started with HTML","data":[{"title":"Installing VS Code \u0026 How Websites Work","description":"Welcome to the exciting world of web development! Whether you\u0027re a seasoned developer exploring a new code editor or a beginner taking the first steps into the realm of web technologies, this guide will walk you through the essential basics.","url":"fundamentals-01.html"},{"title":"HTML Fundamentals: Building the Web","description":"HTML, or HyperText Markup Language, forms the backbone of the World Wide Web. It serves as the standard markup language for creating web pages, employing key components such as elements and attributes.","url":"fundamentals-03.html"},{"title":"HTML Headings, Paragraphs \u0026 links","description":"Welcome back to our exploration of web development basics. In this section, we\u0027ll delve into the importance of headings and paragraphs in HTML, uncover a handy VS Code trick, introduce the concept of a Bookmark Manager for efficient coding, and explore how to create links in HTML.","url":"fundamentals-04.html"},{"title":"HTML Image, Lists, and Tables","description":"Welcome to the in-depth exploration of HTML elements, where we\u0027ll unravel the intricacies of incorporating images, organizing data with tables, and structuring content using lists. Understanding the nuances of these elements is crucial for crafting visually appealing and…","url":"fundamentals-05.html"}]},"highlighted":{"title":"Explore CSS","data":[{"title":"Introduction to CSS","description":"Welcome to the exciting world of Cascading Style Sheets (CSS)! In this guide, we\u0027ll take you on a journey through the fundamentals of CSS, unlocking the power to style and enhance the visual appeal of your web pages. Whether you\u0027re a beginner or looking to refine your skills, this…","url":"fundamentals-14.html"},{"title":"Inline, Internal \u0026 External CSS","description":"Welcome to the realm of CSS styling, where we explore different approaches to enhance the appearance of your web pages. In this guide, we\u0027ll unravel the mysteries of Inline, Internal, and External CSS, providing you with the tools to craft visually stunning and well-organized…","url":"fundamentals-15.html"},{"title":"CSS Selectors","description":"Welcome to the CSS Selectors MasterClass, where we embark on a detailed exploration of CSS selectors. These selectors are the architects of style, allowing you to precisely target and enhance HTML elements. Join us as we dissect each selector, providing detailed examples and…","url":"fundamentals-17.html"},{"title":"CSS Box Model - Margin, Padding \u0026 Borders","description":"Welcome to an essential exploration of the CSS Box Model and the intriguing phenomenon known as Margin Collapse. In this guide, we\u0027ll unravel the structural foundation of CSS, providing insights into how elements are visually rendered on web pages. Join us on this journey to gain a…","url":"fundamentals-18.html"}]},"groups":[{"title":"Contents","type":"cards","display":"normal","data":[{"title":"Inline, Internal \u0026 External CSS","description":"Welcome to the realm of CSS styling, where we explore different approaches to enhance the appearance of your web pages. In this guide, we\u0027ll unravel the mysteries of Inline, Internal, and External CSS, providing you with the tools to craft visually stunning and well-organized…","url":"fundamentals-15.html"},{"title":"CSS Selectors","description":"Welcome to the CSS Selectors MasterClass, where we embark on a detailed exploration of CSS selectors. These selectors are the architects of style, allowing you to precisely target and enhance HTML elements. Join us as we dissect each selector, providing detailed examples and…","url":"fundamentals-17.html"},{"title":"Combinator Selectors","description":"Combinator selectors in CSS allow you to target elements based on their relationship with other elements. Understanding these selectors is crucial for creating precise and efficient stylesheets. Let\u0027s explore the various combinator selectors and how they can be used.","url":"fundamentals-17-01.html"},{"title":"Attribute Selectors in CSS","description":"Attribute selectors in CSS provide a versatile and powerful way to target HTML elements based on the presence or value of their attributes. This allows for more granular and dynamic styling, enhancing the flexibility of your stylesheets.","url":"fundamentals-17-03.html"},{"title":"Pseudo Selectors","description":"Pseudo-class selectors in CSS allow you to style elements based on their state or interaction. These selectors add a layer of dynamism to your stylesheets, enabling you to create visually engaging and responsive designs.","url":"fundamentals-17-02.html"},{"title":"CSS Box Model - Margin, Padding \u0026 Borders","description":"Welcome to an essential exploration of the CSS Box Model and the intriguing phenomenon known as Margin Collapse. In this guide, we\u0027ll unravel the structural foundation of CSS, providing insights into how elements are visually rendered on web pages. Join us on this journey to gain a…","url":"fundamentals-18.html"},{"title":"CSS Fonts, Text \u0026 Color Properties","description":"In CSS, the font property and related properties are used to define the font style, size, weight, and other aspects of text within an HTML element. The font property is a shorthand property that combines several font-related properties into one.","url":"fundamentals-19.html"},{"title":"CSS Specificity \u0026 Cascade","description":"CSS Specificity plays a pivotal role in determining the styles applied to HTML elements, especially in scenarios with overlapping CSS rules. It assigns a value or weight to a CSS selector, and the higher the specificity, the greater the precedence of the selector.","url":"fundamentals-21.html"},{"title":"CSS Sizing Units","description":"In Cascading Style Sheets (CSS), sizing units play a crucial role in defining the dimensions of elements. Each unit has its unique characteristics, and understanding them is essential for creating responsive and flexible designs. Let\u0027s explore these units with detailed examples.","url":"fundamentals-22.html"},{"title":"CSS Display Property","description":"The display property in CSS plays a pivotal role in shaping the layout and visibility of HTML elements on a webpage. It is a versatile tool that determines how elements are rendered and how they interact with other elements.","url":"fundamentals-23.html"},{"title":"CSS Shadows and Outlines","description":"The box-shadow property in CSS enables the creation of shadows around an element. It offers versatility in customizing the shadow\u0027s appearance. The syntax is as follows:","url":"fundamentals-24.html"},{"title":"Styling Lists using CSS","description":"Lists are a fundamental part of HTML, and CSS provides powerful tools to style and enhance them. In this guide, we will explore various techniques for list styling, including using images as list styles and creating a navigation bar using lists.","url":"fundamentals-25.html"},{"title":"CSS Overflow Property","description":"The overflow property in CSS is fundamental for controlling how content that is too large to fit inside a container should be handled, particularly when the content exceeds the dimensions of the containing element.","url":"fundamentals-26.html"},{"title":"CSS Position Property","description":"The position property in CSS is used to specify the positioning method of an element within its containing element. It plays a crucial role in determining how elements are placed and behave on a web page.","url":"fundamentals-28.html"},{"title":"CSS Inheritance","description":"In CSS, inheritance is a mechanism that enables certain properties of an element to be passed down from its parent to its children. This can greatly simplify styling, as properties defined for a parent element can automatically apply to its descendants.","url":"extra-01.html"},{"title":"CSS Variables","description":"CSS Variables, also known as Custom Properties, introduce a way to define reusable values in CSS. They are entities defined by CSS authors that contain specific values to be reused throughout a document.","url":"fundamentals-30.html"},{"title":"CSS Media Queries","description":"CSS Media Queries enable the styling of web pages to adapt based on various device characteristics, such as screen size, resolution, or device type. By using media queries, you can create responsive designs that cater to different devices and screen dimensions. Here\u0027s an overview of…","url":"fundamentals-31.html"},{"title":"CSS Float \u0026 Clear","description":"The float property in CSS is used to position an element to the left or right within its containing element. It is commonly used for creating layouts where elements appear side by side. The floated element is removed from the normal flow of the document, and the surrounding content…","url":"fundamentals-34.html"},{"title":"CSS Flexbox","description":"Flexbox, or the Flexible Box Layout, is a layout model in CSS that allows the design of complex layouts and structures with a more efficient and predictable way than traditional models. Flexbox is particularly well-suited for designing dynamic and resizable layouts. Let\u0027s delve into…","url":"fundamentals-38.html"},{"title":"CSS Z-index and Order","description":"In CSS, z-index and the order property are used to control the stacking order of elements, but they are applied in different contexts.","url":"extra-02.html"},{"title":"CSS Grid","description":"CSS Grid is a powerful layout system that allows developers to create complex two-dimensional layouts with ease. It provides precise control over the positioning and sizing of elements in a grid-based structure. Let\u0027s explore the key concepts and properties of CSS Grid.","url":"fundamentals-39.html"},{"title":"CSS Transforms","description":"CSS Transforms provide a way to modify the appearance of an element in the browser by applying transformations such as rotation, scaling, skewing, and translation. They allow for dynamic changes to the visual presentation of elements, enhancing the flexibility and creativity in web…","url":"fundamentals-42.html"},{"title":"CSS Transitions","description":"CSS transitions allow for the smooth and gradual change of property values over a specified duration. They enhance the user experience by adding animations and visual effects to web pages. In this guide, we\u0027ll explore the key concepts of CSS transitions, including their syntax,…","url":"fundamentals-45.html"},{"title":"CSS Animations","description":"CSS animations enable developers to create dynamic and engaging user interfaces by smoothly transitioning between different styles. In this guide, we\u0027ll explore the fundamentals of CSS animations, covering their syntax, key properties, and common use cases.","url":"fundamentals-46.html"},{"title":"CSS Object-fit and Object-cover","description":"The object-fit property in CSS is used to control how an \u0026lt;img\u0026gt; or \u0026lt;video\u0026gt; element\u0027s content should be resized to fit its container. Meanwhile, object-cover is a specific value for object-fit that maintains the aspect ratio of the content and covers the entire container.","url":"fundamentals-49.html"},{"title":"CSS Filters","description":"CSS filters are a set of image processing properties that enable developers to apply graphical effects to elements, altering the appearance of images, backgrounds, and other visual content on a webpage.","url":"fundamentals-50.html"},{"title":"CSS Functions","description":"Cascading Style Sheets (CSS) functions play a crucial role in web development, providing a wide range of tools to enhance the styling and presentation of HTML elements. In this comprehensive guide, we will explore various CSS functions categorized based on their functionalities.","url":"extra-03.html"},{"title":"CSS clip-path","description":"In CSS, the clip-path property is used to define a clipping region for an element. It allows you to create complex shapes and paths to determine which part of an element should be visible. Here\u0027s a brief explanation:","url":"extra-04.html"},{"title":"CSS Blend Modes","description":"CSS (Cascading Style Sheets) blend modes allow you to blend the colors of elements in different ways, creating interesting visual effects. Here are some common blend modes in CSS:","url":"extra-05.html"},{"title":"CSS Advanced Pseudo-Classes","description":"Tired of repetitive styling and basic hover effects? Buckle up, developers, because we\u0027re about to dive into the world of advanced CSS pseudo-classes! These powerful tools unlock a new level of flexibility and precision, allowing you to target elements based on their dynamic states,…","url":"extra-06.html"},{"title":"Inline and Block Keywords in CSS Properties","description":"Cascading Style Sheets (CSS) provide developers with a powerful toolkit to style and layout web content. Among the various properties at our disposal, the inline and block keywords play a crucial role in defining the behavior of elements along the inline and block axes,…","url":"extra-07.html"}]}],"prevNextLinks":{"prevPageTitle":"Entities, Code tag and more on HTML","nextPageUrl":"fundamentals-14.html","nextPageTitle":"Introduction to CSS","prevPageUrl":"fundamentals-13.html"}}