{"title":"Getting started","subtitle":"Check out the most useful Documentation for Beginners to get you started with HTML and CSS.","tips":[{"title":"Get\n                Started with HTML","description":"Explore our beginner-friendly docs for HTML to get yourself started with Web Development","url":"html-fundamentals.html","type":"documents"},{"title":"Get Started with\n                CSS","description":"Already Know HTML! Checkout our most comprehensive and detailed guide for CSS","url":"css-fundamentals.html","type":"documents"}],"main":{"title":"Get started with HTML","data":[{"title":"Installing VS Code \u0026 How Websites Work","description":"Welcome to the exciting world of web development! Whether you\u0027re a seasoned developer exploring a new code editor or a beginner taking the first steps into the realm of web technologies, this guide will walk you through the essential basics.","url":"fundamentals-01.html"},{"title":"HTML Fundamentals: Building the Web","description":"HTML, or HyperText Markup Language, forms the backbone of the World Wide Web. It serves as the standard markup language for creating web pages, employing key components such as elements and attributes.","url":"fundamentals-03.html"},{"title":"HTML Headings, Paragraphs \u0026 links","description":"Welcome back to our exploration of web development basics. In this section, we\u0027ll delve into the importance of headings and paragraphs in HTML, uncover a handy VS Code trick, introduce the concept of a Bookmark Manager for efficient coding, and explore how to create links in HTML.","url":"fundamentals-04.html"},{"title":"HTML Image, Lists, and Tables","description":"Welcome to the in-depth exploration of HTML elements, where we\u0027ll unravel the intricacies of incorporating images, organizing data with tables, and structuring content using lists. Understanding the nuances of these elements is crucial for crafting visually appealing and…","url":"fundamentals-05.html"}]},"highlighted":{"title":"Explore CSS","data":[{"title":"Introduction to CSS","description":"Welcome to the exciting world of Cascading Style Sheets (CSS)! In this guide, we\u0027ll take you on a journey through the fundamentals of CSS, unlocking the power to style and enhance the visual appeal of your web pages. Whether you\u0027re a beginner or looking to refine your skills, this…","url":"fundamentals-14.html"},{"title":"Inline, Internal \u0026 External CSS","description":"Welcome to the realm of CSS styling, where we explore different approaches to enhance the appearance of your web pages. In this guide, we\u0027ll unravel the mysteries of Inline, Internal, and External CSS, providing you with the tools to craft visually stunning and well-organized…","url":"fundamentals-15.html"},{"title":"CSS Selectors","description":"Welcome to the CSS Selectors MasterClass, where we embark on a detailed exploration of CSS selectors. These selectors are the architects of style, allowing you to precisely target and enhance HTML elements. Join us as we dissect each selector, providing detailed examples and…","url":"fundamentals-17.html"},{"title":"CSS Box Model - Margin, Padding \u0026 Borders","description":"Welcome to an essential exploration of the CSS Box Model and the intriguing phenomenon known as Margin Collapse. In this guide, we\u0027ll unravel the structural foundation of CSS, providing insights into how elements are visually rendered on web pages. Join us on this journey to gain a…","url":"fundamentals-18.html"}]},"groups":[{"type":"links","display":"wide","data":[{"title":"Contact me","data":[{"title":"GitHub","description":"GitHub","url":"https://github.com/RanitManik"},{"title":"LinkedIn","description":"LinkedIn","url":"https://www.linkedin.com/in/ranit-manik/"},{"title":"Instagram","description":"Instagram","url":"https://www.instagram.com/ranit_manik_/"},{"title":"facebook","description":"facebook","url":"https://www.facebook.com/RanitKumarManik/"},{"title":"Twitter","description":"Twitter","url":"https://twitter.com/RANIT_MANIK"}]}]}],"prevNextLinks":{"nextPageUrl":"html-fundamentals.html","nextPageTitle":"HTML Fundamentals"}}